       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX05.
      *ESTE PROGRAMA FOI DESENVOLVIDO EM LINUX E COMPILADO USANDO GNUCBL
       AUTHOR. Matheus Souza Tertuliano.
       DATE-WRITTEN. 17/03/2025.
       DATE-COMPILED.
       SECURITY. APENAS O AUTOR PODE MODIFICA-LO.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. MY-PC.
       OBJECT-COMPUTER. MY-PC.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADCLI1 ASSIGN TO "CADCLI1.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADCLI2 ASSIGN TO "CADCLI2.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CADCLI1.
       01 DADOS-IN.
           05 NUMERO-IN   PIC 9(5).
           05 NOME-IN      PIC X(20).
           05 SEXO          PIC X(1).

       FD CADCLI2.
       01 DADOS-OUT.
           05 NUMERO-OUT   PIC 9(5).
           05 NOME-OUT     PIC X(20).

       WORKING-STORAGE SECTION.
       01 FIMARQ PIC X(1) VALUE "N".

       PROCEDURE DIVISION.
       INICIO.
           OPEN INPUT CADCLI1.
           OPEN OUTPUT CADCLI2.

           PERFORM UNTIL FIMARQ = "S"
               READ CADCLI1 AT END
                   MOVE "S" TO FIMARQ
               NOT AT END
                   IF SEXO = "M"
                       MOVE NUMERO-IN TO NUMERO-OUT
                       MOVE NOME-IN TO NOME-OUT
                       WRITE DADOS-OUT
               END-READ
           END-PERFORM

           CLOSE CADCLI1.
           CLOSE CADCLI2.
           STOP RUN.
